{
    "title1": "What Is CRUD ?",
    "title2": "Examples",
    "title3": "Explanation",
    "paragraph1": "CRUD refers to the 4 basic operations performed on the data. These basic operations are create, read, update and delete respectively. Whether SQL or NoSQL, these http methods are used to add or remove records on the database or to edit the added records. Considering that the server is the bridge between the frontend and the database, it is clear that it can establish a meaningful relationship with each other through these methods. It is clear that the post method from the frontend is a registration process that carries payload for the person who develops on the server-side side. Although it is possible to mix CRUD on the basis of REST architecture, we can say that CRUD is the theoretical set of more basic operations and REST can be built on it.",
    "paragraph2": "Imagine that you have a form on the front side, and you have 1 string 1 det number type input with name and price fields. As soon as you submit the form, the relevant functions worked and you sent a post call to the server-side of your application. Your payload, which matches your url path on the server side, is on its way to be written to the relevant table on the database. Let's say the products table and if these 3 legs of the process are positive, a success response is returned to the front. and the process is complete. This is the general usage, except for the examples that may be out of this explanation. The id is used to delete the Products table and to preface and update the existing data. For these cases, there are uses with params or payload on the server side. Because if you want to operate on a previously created data, you need this information, which is unique to the data in that table, created on the database side of it.",
    "paragraph3": "The Create Part of CRUD, POST adds information on the server.",
    "paragraph4": "The Read Part of CRUD, GET requests information from the server, which is usually displayed.",
    "paragraph5": "The Update Part of CRUD, PUT also updates the server, but in a more specific manner than POST. ",
    "paragraph6": "The Delete Part of CRUD, As its name suggests, DELETE removes data from the server. It, too, is like a more specific POST request. It does not add any new information and simply removes the specified data. "
}